# AssemblyInheritTypeWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AssemblyFailures..::..AssemblyInheritTypeWarn Property
BuiltInFailures..::..AssemblyFailures Class See Also
---
Edits to these assemblies do not match existing types, new type will be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AssemblyInheritTypeWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AssemblyInheritTypeWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AssemblyInheritTypeWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AssemblyFailures Class
Autodesk.Revit.DB Namespace